#실습과제2
// **********************************************
// 제 목 : 문자를 입력 받아 화면에 출력해주는 프로그램
// 날 짜 : 2026년 10월14일
// 작성자 : 2600038 김부성
// **********************************************
// 소스코드 작성
#define _CRT_SECURE_NO_WARNINGS 
#include <stdio.h>
int main(void) 
{
    char ch;

    while (1) 
    {
        printf("문자입력 : ");
        scanf(" %c", &ch);

        if (ch == 'q' || ch == 'Q') 
        {
            break; 
        }

        printf("입력된 문자는 %c\n", ch);
    }

    return 0;
}

  #실습과제3
// **********************************************
// 제 목 : 이름과 혈액형을 압력해 이름과 혈액형이 나오는 프로그램
// 날 짜 : 2026년 10월14일
// 작성자 : 2600038 김부성
// **********************************************
// 소스코드 작성
#define _CRT_SECURE_NO_WARNINGS 
#include <stdio.h>

int main(void)
{
    int x; 
    char name[10];
    char blood_type;

    printf("이름을 입력하시오 : ");
    scanf("%s", name);

    printf("혈액형을 입력하시오 : ");

    scanf(" %c", &blood_type); 

    printf("이름: %s\n", name);
    printf("혈액형: %c\n", blood_type);

    return 0;
}

  #실습과제4
// **********************************************
// 제 목 : 문자를 입력하여 문자출력하는 프로그램
// 날 짜 : 2026년 10월14일
// 작성자 : 2600038 김부성
// **********************************************
// 소스코드 작성
#define _CRT_SECURE_NO_WARNINGS 
#include <stdio.h>

int main(void)
{
    char ch;
    int i;

    for (i = 0; i < 5; i++)
    {
        printf("문자 입력:");

        /* -------------------------------------------------------------
         * 방법 1: 공백 지정자 사용 (" %c")
         * %c 앞에 한 칸의 공백을 두면 버퍼에 남은 엔터('\n')를 자동 무시합니다.
         * ------------------------------------------------------------- */
        scanf(" %c", &ch); 


        /* -------------------------------------------------------------
         * 방법 2: getchar() 함수 사용
         * 기존 scanf("%c", &ch);를 그대로 쓸 때는 아래 주석을 풀어서 
         * 버퍼에 남은 엔터('\n')를 직접 읽어내어 지워줘야 합니다.
         * -------------------------------------------------------------
         * scanf("%c", &ch);
         * getchar(); // 버퍼의 엔터키(\n)를 제거하는 역할
         * ------------------------------------------------------------- */

        printf("문자: %c\n", ch);
    }

    return 0;
}

  #실습과제5
// **********************************************
// 제 목 : 문자열을 입력하여 문자열 출력하ㅡ는 프로그램
// 날 짜 : 2026년 10월14일
// 작성자 : 2600038 김부성
// **********************************************
// 소스코드 작성
#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>

int main(void)
{
    char str[20];
    char ch;
    int i = 0;

    printf("문자열을 입력하시오 : ");

    
    while (1) 
    {
        scanf("%c", &ch); 

        if (ch == '\n') 
        { 
            break;
        }

        str[i] = ch; 
        i++;
    }

    printf("문자열: %s\n", str);

    return 0;
}
